#int არის ფუნქცია რომელშიც მხოლოდ და მხოლოდ შედის მთელი რიცხვები ანუ (-5,-3,0,1,4,6) და ასე შემდეგ.
#str არის არის ფუნქცია რომელშიც შედის სიტყვები. სიტყვებს კი გარედან ანუ მარჯვენა და მარცხენა მხრიდან სჭირდება ბრჭყალები.
#type არის ფუნქცია რომელიც ადგენს რაიმის მნიშვნელობა თუ რომელ ფუნქციას მიეკუთვნება.მაგალითად, type(3)+int, type(1.6)=float, type(Jesus Christ)=str
#input არის ფუნქცია რომელშიც შეგვიძლია მივუთითოთ თუ რა მნიშვნელობა გვინდა მივანიჭოთ ცვლადს.მაგალითად, x=input("enter it's meaning") print(x) და დაპრინტვისას შეგვიძლია მივუთითოთ რა მნიშნელობაც გვინდა მივანიჭოთ.